In [2]:
# DataFrame: cria uamaTabela bidimensional de dados, composta por linhas e colunas.
# Series :  Estrutura unidimensional, representando uma coluna ou linha de um DataFrame.

import pandas as pd 
import numpy as np 

lista = np.arange(8)**2
dt = pd.Series(lista)
display(dt)


lista3 = {
    'nums' : np.arange(8)**2,
    'number': np.arange(8)*2
}

dt = pd.DataFrame(lista3)
print(dt)


arr = np.arange(8).reshape(2,4)**2
dt3 = pd.DataFrame(arr)
display(dt3)

0     0
1     1
2     4
3     9
4    16
5    25
6    36
7    49
dtype: int32

   nums  number
0     0       0
1     1       2
2     4       4
3     9       6
4    16       8
5    25      10
6    36      12
7    49      14

    0   1   2   3
0   0   1   4   9
1  16  25  36  49

In [27]:
lista3 = np.arange(8) + 2
ser = pd.Series(lista3, name='number')
display(ser)

0    2
1    3
2    4
3    5
4    6
5    7
6    8
7    9
Name: number, dtype: int32

In [24]:
# head(n): Retorna as primeiras n linhas do DataFrame ou da Series.
# tail(n): Retorna as últimas n linhas do DataFrame ou da Series.
# .to_csv('arquivo.csv'): Salva o DataFrame em um arquivo CSV.
# .min(): Retorna o valor mínimo em uma Series ou ao longo de um eixo no DataFrame.
# .max(): Retorna o valor máximo em uma Series ou ao longo de um eixo no DataFrame.
# .cumsum(): Retorna a soma cumulativa de uma Series.
# .mean(): Retorna a média dos valores em uma Series ou ao longo de um eixo no DataFrame.
# .value_counts(): Retorna uma contagem de valores únicos em uma Series.
# .sort_values(): Ordena os valores em uma Series ou um DataFrame em ordem ascendente ou descendente.

listaA = np.arange(7)
listaB = np.arange(4)*4
listaC = ['a', 'b', 'c', 'd','a', 'b', 'a'] 


dict = {'numeros ': listaA
        ,'letras': listaC}

dic = pd.DataFrame(dict)
display(dic)

# pega os dois primeiros
display(dic.head(2))
# pega os dois ultimos
display(dic.tail(2))

display(dic.min())
display(dic.max())
display(dic.cumsum()['letras'])
display(dic['letras'].value_counts())
display(dic['letras'].sort_values())

   numeros  letras
0         0      a
1         1      b
2         2      c
3         3      d
4         4      a
5         5      b
6         6      a

   numeros  letras
0         0      a
1         1      b

   numeros  letras
5         5      b
6         6      a

numeros     0
letras      a
dtype: object

numeros     6
letras      d
dtype: object

0          a
1         ab
2        abc
3       abcd
4      abcda
5     abcdab
6    abcdaba
Name: letras, dtype: object

letras
a    3
b    2
c    1
d    1
Name: count, dtype: int64

0    a
4    a
6    a
1    b
5    b
2    c
3    d
Name: letras, dtype: object

In [34]:
# loc: É usado para acessar um grupo de linhas e colunas por meio de rótulos ou uma condição booleana.
# iloc: É usado para acessar um grupo de linhas e colunas por meio de índices (números inteiros).

url_players = 'D:/donwloads/archive/player_data.csv'

dt = pd.read_csv(url_players)

tabela_analise = dt.loc[0:5, ['name', 'year_start']]
display(tabela_analise)
display('_______________________________________________________________________________________')

# pega da linha 0 a 5 e depois seleciona a coluna 3, 4 e 5
tabela_analise_exemplo_iloc = dt.iloc[0:5, 2:5]
display(tabela_analise_exemplo_iloc)

                  name  year_start
0       Alaa Abdelnaby        1991
1      Zaid Abdul-Aziz        1969
2  Kareem Abdul-Jabbar        1970
3   Mahmoud Abdul-Rauf        1991
4    Tariq Abdul-Wahad        1998
5  Shareef Abdur-Rahim        1997

'_______________________________________________________________________________________'

   year_end position height
0      1995      F-C   6-10
1      1978      C-F    6-9
2      1989        C    7-2
3      2001        G    6-1
4      2003        F    6-6

In [42]:
# Concat:
# Merge: 

lista2 = np.arange(3)
lista1 = np.arange(8).reshape(2,4)**2


dt  = pd.DataFrame(lista1)
dt2 = pd.DataFrame(lista2)

dt3 = pd.concat([dt2, dt], ignore_index=True)

display(dt3)

display('______________________________________________________________')

    0     1     2     3
0   0   NaN   NaN   NaN
1   1   NaN   NaN   NaN
2   2   NaN   NaN   NaN
3   0   1.0   4.0   9.0
4  16  25.0  36.0  49.0